<a href="#"><img  height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></a> 



<div align="right"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a>&nbsp;2&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>&nbsp;3&nbsp;High</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>I02-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>src</td>

<td>Inbound "From Any allow all TCP" rules from Public IPs</td>

</tr>
<tr>

<td>I03-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>src</td>

<td>Inbound "From Any allow all UDP" rules from Public IPs</td>

</tr>
<tr>

<td>I05-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>src</td>

<td>TCP on all ports can enter your network from Public IPs</td>

</tr>
<tr>

<td>I06-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>src</td>

<td>UDP on all ports can enter your network from Public IPs</td>

</tr>
<tr>

<td>I07-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>src</td>

<td>LDAP Port TCP/389, UDP/389 open from Public IPs</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>src</b></h3><div  align="right"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a>&nbsp;2&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>&nbsp;3&nbsp;High</div></summary>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a>  I02-I-GCP</summary> 

### **Title:**
Inbound "From Any allow all TCP" rules from Public IPs

### **Description:**
Inbound rules of the form "From Any with all TCP : PASS" are usually more open than is necessary. Allowing all TCP allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access from all sources may allow access to from risky locations. This subnet is connected to the Internet, elevating the level of risk.

### **Recommendation:**
Restrict the rules to refer to only the source IPs and services you really use.

### **Details:**

```

[
	{
		"vendor": "GCP",
		"source": "i02-ni-gcp",
		"toPort": 389,
		"fromPort": 389,
		"ipProtocol": "tcp",
		"ipRange": [
			"0.0.0.0/0"
		]
	}
]

```

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a>  I03-I-GCP</summary> 

### **Title:**
Inbound "From Any allow all UDP" rules from Public IPs

### **Description:**
Inbound rules of the form "From Any with all UDP : PASS" are usually more open than is necessary. Allowing all UDP allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access from all sources may allow access to from risky locations. This subnet is connected to the Internet, elevating the level of risk.

### **Recommendation:**
Restrict the rules to refer to only the source IPs and services you really use.

### **Details:**

```

[
	{
		"vendor": "GCP",
		"source": "i02-ni-gcp",
		"toPort": 389,
		"fromPort": 389,
		"ipProtocol": "tcp",
		"ipRange": [
			"0.0.0.0/0"
		]
	}
]

```

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  I05-I-GCP</summary> 

### **Title:**
TCP on all ports can enter your network from Public IPs

### **Description:**
Allowing TCP on all ports to enter your network is extremely riskysince this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 

### **Recommendation:**
Review all the rules that allow inbound traffic with TCP on all ports, and limit them to those services you actually require. 

### **Details:**

```

[
	{
		"vendor": "GCP",
		"source": "i02-ni-gcp",
		"toPort": 389,
		"fromPort": 389,
		"ipProtocol": "tcp",
		"ipRange": [
			"0.0.0.0/0"
		]
	}
]

```

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  I06-I-GCP</summary> 

### **Title:**
UDP on all ports can enter your network from Public IPs

### **Description:**
Allowing UDP on all ports to enter your network is extremely risky since this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 

### **Recommendation:**
Review all the rules that allow inbound traffic with UDP on all ports, and limit them to those services you actually require. 
    

### **Details:**

```

[
	{
		"vendor": "GCP",
		"source": "i02-ni-gcp",
		"toPort": 389,
		"fromPort": 389,
		"ipProtocol": "tcp",
		"ipRange": [
			"0.0.0.0/0"
		]
	}
]

```

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  I07-I-GCP</summary> 

### **Title:**
LDAP Port TCP/389, UDP/389 open from Public IPs

### **Description:**
Your cloud  LDAP server is accessible using the LDAP port (UDP/389, TCP/389).  LDAP (Lightweight Directory Access Protocol) is a directory service for controling access to network capable devices. Allowing access to these ports from public IP addresses is risky.


### **Recommendation:**
Eliminate rules which allow access to this port from the Internet.


### **Details:**

```

[
	{
		"vendor": "GCP",
		"source": "i02-ni-gcp",
		"toPort": 389,
		"fromPort": 389,
		"ipProtocol": "tcp",
		"ipRange": [
			"0.0.0.0/0"
		]
	}
]

```

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.i02-ni-gcp will be created
  + resource "google_compute_firewall" "i02-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "INGRESS"
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-single-port"
      + network            = "devsecops-network-gcp"
      + priority           = 1100
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "389",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "389",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 1460
      + name                            = "devsecops-network-gcp"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src\tmp\src.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src\\tmp\\src.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @Artsemil<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD